In [ ]:
#Day 1 programs

In [2]:
import pandas as pd

In [5]:
a = "80085"
type(a)

str

In [16]:
fruits = ['Banana','Apple','Mango','Watermelon','kiwi']

In [17]:
for x in fruits:
    print(x)

Banana
Apple
Mango
Watermelon
kiwi

In [21]:
import csv

In [22]:
data= [
    ['Name','Age','City'],
    ['Satwik','21','Lalitpur'],
    ['Yube','21','Lalitpur'],
]

In [26]:
with open("data.csv","w",newline="") as file:
    writer = csv.writer(file)
    writer.writerows(data)

In [28]:
pd.__version__

'2.2.2'

In [30]:
pd.read_csv('data.csv')

     Name  Age      City
0  Satwik   21  Lalitpur
1    Yube   21  Lalitpur

In [43]:
data= [
    ['Name','Age','City'],
    ['Satwik','21','Lalitpur'],
    ['Yube','21','Lalitpur'],
    ['Noor','28','Hell']
]
df = pd.DataFrame(data)

In [44]:
print(type(df))
print(type(df[0]))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [6]:
Data = {
    'Id':['0001','0002','6969'],
    'Name':['Satwik','Yube','Noor'],
    'Age':[21,25,28],
    'Salary':['50000','45000','40000']
}
df = pd.DataFrame(Data)

In [49]:
df.head(1) #no parameter passed means 5 rows 
df.tail(2)

   Name Age Salary
1  Yube  21  45000
2  Noor  28  40000

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      object
 2   Salary  3 non-null      object
dtypes: object(3)
memory usage: 204.0+ bytes

In [65]:
df.describe()
df.describe(include=['object'])

          Id    Name Age Salary
count      3       3   3      3
unique     3       3   2      3
top     0001  Satwik  21  50000
freq       1       1   2      1

In [66]:
df.dtypes

Id        object
Name      object
Age       object
Salary    object
dtype: object

In [69]:
df[['Salary']]

  Salary
0  50000
1  45000
2  40000

In [72]:
df.columns

Index(['Id', 'Name', 'Age', 'Salary'], dtype='object')

In [76]:
df.index
df.index = df['Id']

In [77]:
df

        Id    Name Age Salary
Id
0001  0001  Satwik  21  50000
0002  0002    Yube  21  45000
6969  6969    Noor  28  40000

In [1]:
#Day 2 Programs

In [10]:
df['Age']==25

0    False
1     True
2    False
Name: Age, dtype: bool

In [17]:
allowed_ages =[25,21]
df[df['Age'].isin(allowed_ages)]

     Id    Name  Age Salary
0  0001  Satwik   21  50000
1  0002    Yube   25  45000

In [23]:
df[~df['Name'].str.startswith('S')]

     Id  Name  Age Salary
1  0002  Yube   25  45000
2  6969  Noor   28  40000

In [25]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [27]:
df[['Age']]

   Age
0   21
1   25
2   28

In [46]:
df.loc[1]

Id         0002
Name       Yube
Age          25
Salary    45000
Name: 1, dtype: object

In [47]:
df.iloc[0]

Id          0001
Name      Satwik
Age           21
Salary     50000
Name: 0, dtype: object